nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1180/driver_examples/qtmr/inputcapture_outputpwm_dma/cm7/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define QTIMER_CTRL1_QTIMER4_TMR0_INPUT_SEL_IOMUX 0x00U /*!< QTIMER4 TMR0 input select: Input from IOMUX */
#define QTIMER_CTRL1_QTIMER4_TMR1_INPUT_SEL_IOMUX 0x00U /*!< QTIMER4 TMR1 input select: Input from IOMUX */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
